//例题
//输出：-1 -1 255 4294967168(整型提升，有无符号位)
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main() {
	char a = -1;
	//内存中存的是补码
	//-1的补码：11111111111111111111111111111111
	//因为是char类型，内存中存的是一个字节：11111111
	//以%d打印要整型提升高位要补到四个字节，高位补符号位。
	//11111111111111111111111111111111----补码(内存中存的)
	//打印要转换成原码
	//10000000000000000000000000000001----原码(-1)
	char e = -128;
	//内存中存的是补码
	//-128的补码：10000000000000000000000010000000
	//因为是char类型，内存中存的是一个字节：1000000
	//以%u打印要整型提升高位要补到四个字节，高位补符号位。
	//11111111111111111111111110000000----补码(内存中存的)
	//打印要转换成原码,由于%u是打印十进制无符号数字，原反补一样
	//11111111111111111111111110000000----原码(4294967168)
	signed char b = -1;
	//11111111111111111111111111111111----补码(内存中存的)
	//打印要转换成原码
	//10000000000000000000000000000001----原码(-1)
	unsigned char c = -1;
	//无符号数高位补0
	//00000000000000000000000011111111----补码(内存中存的)
	//打印要转换成原码
	//00000000000000000000000011111111----原码(255)
	printf("%d %d %d %u ", a, b, c, e);
	return 0;
}
